---
title: ElementNode
classe: Autodesk.Revit.DB.ElementNode
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.RenderNode
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# ElementNode

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Document Document { get; }` | `elementNode.Document` | Document |
| `ElementId ElementId { get; }` | `elementNode.ElementId` | ElementId |
| `ElementId LinkInstanceId { get; }` | `elementNode.LinkInstanceId` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```